class Menupage(object):
    # 欢迎界面
    def WelcomeView(self):
        index_default_menu = '''
                    **********************************************
                    *                                            *
                    *                                            *
                    *               欢迎登录风暴银行              *
                    *                                            *
                    *                                            *
                    **********************************************
        -------------------------------------------------------------------------
                                        ATM 模拟程序                                                                                  
        -------------------------------------------------------------------------
        【a】进入商城 【b】卡中心 【c】商品后台管理 【d】待定 【e】退出系统
        '''
        print(index_default_menu)




    # 用户功能界面
    def FunctionView(self):
        UserMenu='''
        **********************************************
        *           开户（1）     查询（2）           *
        *           取款（3）     存款（4）           *
        *           转账（5）     改密码（6)          *
        *           锁定（7）     解锁（8）           *
        *           补卡（9）     销户（10）          *
        *                   退出（0）                 *
        **********************************************        
        '''
        print(UserMenu)

    #商场界面
    def shopping(self):
        index_UserShopping_Menu = '''
                  ------------------------------------------------------------------------------
                                                      商场管理

                  ------------------------------------------------------------------------------
                  【1】添加商品    【2】修改商品    【3】删除商品     【4】查看购物车    【5】结算    【6】退出
                  '''
        print(index_UserShopping_Menu)
